---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkIterator.Start
source: html/35f6219c-2d2d-0f5c-6b76-bc9d625d8867.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkIterator.Start Method

Gets the first step of network iteration.

## Syntax (C#)
```csharp
public void Start()
```

## Remarks
The first step may not contain any analytical segment, but the first analytical node.